app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "#so #excited"], ["created_at", Fri, 25 Oct 2013 03:10:37 UTC +00:00], ["title", "First Post"], ["updated_at", Fri, 25 Oct 2013 03:10:37 UTC +00:00]]